
/*---------------------------------------------------------------------*/
/* --- STC MCU International Limited ----------------------------------*/
/* --- STC 1T Series MCU Demo Programme -------------------------------*/
/* --- Mobile: (86)13922805190 ----------------------------------------*/
/* --- Fax: 86-0513-55012956,55012947,55012969 ------------------------*/
/* --- Tel: 86-0513-55012928,55012929,55012966 ------------------------*/
/* --- Web: www.GXWMCU.com --------------------------------------------*/
/* --- QQ:  800003751 -------------------------------------------------*/
/* Èç¹ûÒªÔÚ³ÌÐòÖÐÊ¹ÓÃ´Ë´úÂë,ÇëÔÚ³ÌÐòÖÐ×¢Ã÷Ê¹ÓÃÁËºê¾§¿Æ¼¼µÄ×ÊÁÏ¼°³ÌÐò   */
/*---------------------------------------------------------------------*/


/*************	¹¦ÄÜËµÃ÷	**************

±¾ÎÄ¼þÎªSTC15xxxÏµÁÐµÄÑÓÊ±³ÌÐò,ÓÃ»§¼¸ºõ¿ÉÒÔ²»ÐÞ¸ÄÕâ¸ö³ÌÐò.

******************************************/

#include	"delay.h"



//========================================================================
// º¯Êý: void  delay_ms(unsigned char ms)
// ÃèÊö: ÑÓÊ±º¯Êý¡£
// ²ÎÊý: ms,ÒªÑÓÊ±µÄmsÊý, ÕâÀïÖ»Ö§³Ö1~255ms. ×Ô¶¯ÊÊÓ¦Ö÷Ê±ÖÓ.
// ·µ»Ø: none.
// °æ±¾: VER1.0
// ÈÕÆÚ: 2013-4-1
// ±¸×¢: 
//========================================================================
void  delay_ms(unsigned char ms)
{
     unsigned int i;
	 do{
	      i = MAIN_Fosc / 13000;
		  while(--i)	;   //14T per loop
     }while(--ms);
}
/*
*
* åŠŸèƒ½: ç”¨æˆ·è‡ªå®šä¹‰å®šæ—¶å‡½æ•°
* Added by YangXiao
*/

void delay_us(unsigned char us)
{
     unsigned int i;
     do {
         i = MAIN_Fosc / 13;
	 while(--i); // 14000T per loop
     } while(--us);
}

